# 2. Вывести на экран текущее название дня недели, название месяца и свое имя.
# Каждое слово должно быть в отдельной строке
my_string = 'Вторник'
print(my_string)
my_string = 'Июнь'
print(my_string)
my_string = 'Владимир'
print(my_string)
