# 1. Вывести на экран текст "Hello World"
print('hello,world!')
