# 1. Вывести на экран текст "Hello World"
print('hello,world!')
print(12 % 10)
print(12 // 10)
