# 13. Налоги и чаевые. Программа, которую вы напишете, должна начинаться с запроса у пользователя суммы заказа в ресторане.
# После этого должен быть произведен расчет налога и чаевых официанту. Вы можете использовать принятую в вашем регионе
# налоговую ставку для подсчета суммы сборов. В качестве чаевых мы оставим 18 % от стоимости заказа без
# учета налога. На выходе программа должна отобразить
# отдельно налог, сумму чаевых и итог, включая обе
# составляющие. Форматируйте вывод таким образом, чтобы все
# числа отображались с двумя знаками после запятой
zapros = float(input('Введите сумму заказа :'))
print(zapros)
tax = float((zapros * 22) / 100)
print('Налог составляет :', round(tax, 2), 'рублей')
gratuity = float((zapros * 18) / 100)
print('Чаевые составляют :', round(gratuity, 2), 'рублей')
print('Итог :', zapros)
