# 3. Вывести на экран пять строк из нулей, причем количество нулей в каждой строке равно номеру строки
# my_string = '0,0'
# print(my_string)
# my_string = '0,0,0,0'
# print(my_string)
# my_string = '0,0,0,0,0,0'
# print(my_string)
# my_string = '0,0,0,0,0,0,0,0'
# print(my_string)
# my_string = '0,0,0,0,0,0,0,0,0,0'
# print(my_string)

for i in range(1, 6):
    print('0' * i)
    print('I love your Python!')
